---
kind: method
id: M:Autodesk.Revit.DB.FilterableValueProvider.GetElementIdValue(Autodesk.Revit.DB.Element)
source: html/ba7baf5a-ebf0-091a-7a43-3ef3c0d8d28f.htm
---
# Autodesk.Revit.DB.FilterableValueProvider.GetElementIdValue Method

Gets an ElementId value from the given element.

## Syntax (C#)
```csharp
public ElementId GetElementIdValue(
	Element element
)
```

## Parameters
- **element** (`Autodesk.Revit.DB.Element`) - The element to query.

## Returns
The ElementId value from the element.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null